import word_collect
import webbrowser

print('''
	██████╗ ███████╗███████╗██████╗ ███████╗███████╗ █████╗ ██████╗  ██████╗██╗  ██╗
	██╔══██╗██╔════╝██╔════╝██╔══██╗██╔════╝██╔════╝██╔══██╗██╔══██╗██╔════╝██║  ██║
	██║  ██║█████╗  █████╗  ██████╔╝███████╗█████╗  ███████║██████╔╝██║     ███████║
	██║  ██║██╔══╝  ██╔══╝  ██╔═══╝ ╚════██║██╔══╝  ██╔══██║██╔══██╗██║     ██╔══██║
	██████╔╝███████╗███████╗██║     ███████║███████╗██║  ██║██║  ██║╚██████╗██║  ██║
	╚═════╝ ╚══════╝╚══════╝╚═╝     ╚══════╝╚══════╝╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝╚═╝  ╚═╝''')

print("원하는 기능을 선택하세요.")
print("--------------------------------------------------------------------------------------")
print("1: 문자 데이터 수집, 2: 이미지 데이터 수집, 3: 수집된 문자 데이터 보기, 4: 수집된 이미지 데이터 보기")
n = int(input())

if n == 1:
    word = input("수집하고 싶은 키워드를 입력하시오.(여러 단어인 경우 띄어쓰기로 구분) : ")
    keyword = word.split(" ")
    word_collect.start(keyword)

if n == 2:
    url = "http://146.56.172.84/crawlingtest.php"
    webbrowser.open(url)

if n == 3:
    url = "http://146.56.172.84/crawling_siyeon.php"
    webbrowser.open(url)

if n == 4:
    url = "http://146.56.172.84/crawlingtest.php"
    webbrowser.open(url)
